src/Catalogs/ОбластиХранения/ОбластиХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбластиХранения</name>
  <owners>Catalog.Склады</owners>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетРазмещенияВСвободныеЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетРазмещенияВМонотоварныеЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетРазмещенияВСмешанныеЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетРазмещенияВЯчейкиСДругимТоваром</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетОтбораИзМонотоварныхЯчеек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетОтбораИзСмешанныхЯчеек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетОтбораПодОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеМонотоварности</name>
    <type>
      <types>EnumRef.ОписаниеМонотоварности</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрогаяМонотоварность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеПериодичностиИнвентаризацииЯчеек</name>
    <type>
      <types>EnumRef.ВариантыИспользованияПериодическойИнвентаризацииЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейМеждуИнвентаризациями</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьОбособленногоХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ВариантыИспользованияПериодическойИнвентаризацииЯчеек/ВариантыИспользованияПериодическойИнвентаризацииЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыИспользованияПериодическойИнвентаризацииЯчеек</name>
  <enumValues>
    <name>НеИспользовать</name>
    <comment>Не использовать периодическую инвентаризацию ячеек</comment>
  </enumValues>
  <enumValues>
    <name>ИспользоватьНастройкиОбластиХранения</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьНастройкиЯчейки</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ОбластиХранения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Не СкладыСервер.ИспользоватьСкладскиеПомещения(Владелец) Тогда
    	МассивНепроверяемыхРеквизитов.Добавить("Помещение");
	КонецЕсли;
				
	Если Не СкладыСервер.ИспользоватьАдресноеХранение(Владелец, Помещение) Тогда
		
		ТекстСообщения = НСтр("ru='По складу ""%Склад%"" не используется адресное хранение!';uk='По складу ""%Склад%"" не використовується адресне зберігання!'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%Склад%",СкладыСервер.ПолучитьПредставлениеСклада(Владелец,Помещение));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,"Склад","Объект",Отказ);
	КонецЕсли;
	
	Если ИспользованиеПериодичностиИнвентаризацииЯчеек 
		= Перечисления.ВариантыИспользованияПериодическойИнвентаризацииЯчеек.НеИспользовать Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("КоличествоДнейМеждуИнвентаризациями");
			
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
